lsoldano93/ECSE426/Lab4_STM32F4Cube_Base_project/Sources/accelerometer.h
#ifndef ACCELEROMETER_H
#define ACCELEROMETER_H

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"   
#include "lis3dsh.h"
#include "global_vars.h"
#include "math.h"

/* Private typedef -----------------------------------------------------------*/

typedef struct {
	float x; 
	float y; 
	float z;
} accelerometer_values;

#define PI 3.14159265358
#define ACC11 0.9523
#define ACC12 -0.0019
#define ACC13 -0.0079
#define ACC10 -0.0297
#define ACC21 -0.0397
#define ACC22 0.9896
#define ACC23 -0.0105
#define ACC20 0.0070
#define ACC31 -0.0047
#define ACC32 -0.0024
#define ACC33 1.0087
#define ACC30 -0.0328 
#define DEGREES(x) (180.0*x/PI)

/* Private variables ---------------------------------------------------------*/
//Might want to make these two global

osThreadId tid_Thread_Accelerometer;
float accelerometer_out[3];
accelerometer_values accel;
float accel_x, accel_y, accel_z;
float roll, pitch;
kalman_t kalmanX, kalmanY, kalmanZ;
/* Private function prototypes -----------------------------------------------*/ 
int start_Thread_Accelerometer (void);

void Thread_Accelerometer (void const *argument);

void accelerometer_mode(void) {
	
/**  Accelerometer bread and butter
   * @brief  Updates x, y, z parameters of accelerometer by reading from MEMs device
	 * @param  Locations where updated values will be stored **/
void update_accel_values(float Ax, float Ay, float Az);

/**  Calculates pitch angle
   * @brief  Calculates pitch angle
   * @retval Returns pitch angle **/
float calc_pitch_angle(void);

/**  Calculates roll angle
   * @brief  Calculates roll angle
   * @retval Returns roll angle **/
float calc_roll_angle(void);

/**  Calculates yaw angle
   * @brief  Calculates yaw angle
   * @retval Returns yaw angle **/
float calc_yaw_angle(void);

void config_accelerometer_kalman(void);

/**  Initialize accelerometer
   * @brief  Initializes accelerometer for use **/
void init_accelerometer(void);



#endif